In [15]:
# Import our dependencies
from pymongo import MongoClient
from pprint import pprint
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
import pandas as pd
import tensorflow as tf
from tabulate import tabulate
from sklearn.neighbors import KNeighborsClassifier
from sklearn.metrics import classification_report

In [32]:
# Connect to MongoDB Atlas
client = MongoClient("mongodb+srv://group_user:UTProj4@project4.ofsuk.mongodb.net/remote?retryWrites=true&w=majority")

# Access the 'remote' database
db = client['remote']

# Fetch data from the 'records' collection
data_cursor = db['records'].find()
data_list = list(data_cursor)
data_df = pd.DataFrame(data_list)  # Convert to DataFrame

# Fetch data from the 'credit' collection
record_cursor = db['credit'].find()
record_list = list(record_cursor)
record_df = pd.DataFrame(record_list)  # Convert to DataFrame

In [33]:
data_df.head()

,_id,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,675254e98aa915569ed1d101,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,,2.0
1,675254e98aa915569ed1d102,5008813,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,,1.0
2,675254e98aa915569ed1d103,5008814,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,-22464,365243,1,0,0,0,,1.0
3,675254e98aa915569ed1d104,5008815,M,Y,Y,0,270000.0,Working,Higher education,Married,House / apartment,-16872,-769,1,1,1,1,Accountants,2.0
4,675254e98aa915569ed1d105,5112956,M,Y,Y,0,270000.0,Working,Higher education,Married,House / apartment,-16872,-769,1,1,1,1,Accountants,2.0

In [34]:
record_df.head()

                        _id       ID  MONTHS_BALANCE STATUS
0  67525a6d253585cd3ae0c706  5001711              -1      0
1  67525a6d253585cd3ae0c707  5001711              -2      0
2  67525a6d253585cd3ae0c708  5001711               0      X
3  67525a6d253585cd3ae0c709  5001711              -3      0
4  67525a6d253585cd3ae0c70a  5001712               0      C

# STILL BROKEN

In [38]:
# Group and process the 'credit' collection DataFrame
begin_month = record_df.groupby("ID")["MONTHS_BALANCE"].agg(min).reset_index()
begin_month = begin_month.rename(columns={'MONTHS_BALANCE': 'begin_month'})

# Merge the DataFrames on the 'ID' column
merged_df = pd.merge(data_df, begin_month, how="left", on="ID")
merged_df = pd.DataFrame(merged_df)

# Show the first few rows of the merged DataFrame
print(merged_df.head())

                        _id       ID CODE_GENDER FLAG_OWN_CAR FLAG_OWN_REALTY  \
0  675254e98aa915569ed1d101  5008805           M            Y               Y
1  675254e98aa915569ed1d102  5008813           F            N               Y
2  675254e98aa915569ed1d103  5008814           F            N               Y
3  675254e98aa915569ed1d104  5008815           M            Y               Y
4  675254e98aa915569ed1d105  5112956           M            Y               Y

   CNT_CHILDREN  AMT_INCOME_TOTAL NAME_INCOME_TYPE NAME_EDUCATION_TYPE  \
0             0          427500.0          Working    Higher education
1             0          283500.0        Pensioner    Higher education
2             0          283500.0        Pensioner    Higher education
3             0          270000.0          Working    Higher education
4             0          270000.0          Working    Higher education

  NAME_FAMILY_STATUS  NAME_HOUSING_TYPE  DAYS_BIRTH  DAYS_EMPLOYED  \
0     Civil marriage   Rented apartment      -12005          -4542
1          Separated  House / apartment      -22464         365243
2          Separated  House / apartment      -22464         365243
3            Married  House / apartment      -16872           -769
4            Married  House / apartment      -16872           -769

   FLAG_MOBIL  FLAG_WORK_PHONE  FLAG_PHONE  FLAG_EMAIL OCCUPATION_TYPE  \
0           1                1           0           0
1           1                0           0           0
2           1                0           0           0
3           1                1           1           1     Accountants
4           1                1           1           1     Accountants

   CNT_FAM_MEMBERS  begin_month
0              2.0          NaN
1              1.0          NaN
2              1.0          NaN
3              2.0          NaN
4              2.0          NaN

C:\Users\Laura\AppData\Local\Temp\ipykernel_2344\2429288361.py:2: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  begin_month = record_df.groupby("ID")["MONTHS_BALANCE"].agg(min).reset_index()

In [39]:
print(merged_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 20 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   _id                  438557 non-null  object
 1   ID                   438557 non-null  int64
 2   CODE_GENDER          438557 non-null  object
 3   FLAG_OWN_CAR         438557 non-null  object
 4   FLAG_OWN_REALTY      438557 non-null  object
 5   CNT_CHILDREN         438557 non-null  int64
 6   AMT_INCOME_TOTAL     438557 non-null  float64
 7   NAME_INCOME_TYPE     438557 non-null  object
 8   NAME_EDUCATION_TYPE  438557 non-null  object
 9   NAME_FAMILY_STATUS   438557 non-null  object
 10  NAME_HOUSING_TYPE    438557 non-null  object
 11  DAYS_BIRTH           438557 non-null  int64
 12  DAYS_EMPLOYED        438557 non-null  int64
 13  FLAG_MOBIL           438557 non-null  int64
 14  FLAG_WORK_PHONE      438557 non-null  int64
 15  FLAG_PHONE           438557 non-null  int64
 16  FLAG_EMAIL           438557 non-null  int64
 17  OCCUPATION_TYPE      438557 non-null  object
 18  CNT_FAM_MEMBERS      438557 non-null  float64
 19  begin_month          0 non-null       float64
dtypes: float64(3), int64(8), object(9)
memory usage: 66.9+ MB
None

# NEED TO FIND OUT WHY IT'S NOT MERGING ANYTHING. begin_month is still 0

In [41]:
print(data_df.columns)
print(record_df.columns)

Index(['_id', 'ID', 'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY',
       'CNT_CHILDREN', 'AMT_INCOME_TOTAL', 'NAME_INCOME_TYPE',
       'NAME_EDUCATION_TYPE', 'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE',
       'DAYS_BIRTH', 'DAYS_EMPLOYED', 'FLAG_MOBIL', 'FLAG_WORK_PHONE',
       'FLAG_PHONE', 'FLAG_EMAIL', 'OCCUPATION_TYPE', 'CNT_FAM_MEMBERS'],
      dtype='object')
Index(['_id', 'ID', 'MONTHS_BALANCE', 'STATUS'], dtype='object')